package response

import (
	"strings"
)

var CodeService = map[int]string{

	0: "操作失败%%0",
	1: "操作成功",
	2: "没有权限",
	3: "%%0",

	//服务错误
	404: "接口不存在",
	500: "服务器居然开小差了，请稍后再试吧！",

	//通用错误
	1000: "服务器繁忙，请稍后重试",
	1001: "请勿重复请求",
	3000: "参数错误:%%0",
	3002: "下单失败,需要提交应用上线！",
	3003: "下单失败,应用信息错误！",

	4001: "更新数据信息错误",
	4002: "验证码错误",

	99999: "签名错误:%%0",

	999: "请求错误或登录超时",

	900: "非后台用户，禁止操作",

	//商品10xxx
	10000: "%%0",
	10001: "地址解析失败",
	10002: "%%0",
	10003: "%%0",
	10004: "一次最多购买50个不同规格商品",
	10005: "%%0",
	10006: "%%0商品异常，校验失败",
	10007: "%%0服务费率获取失败",
	10008: "%%0您的采购量过大请联系客户确认库存",
	10009: "%%0价格异常,请及时更新价格",
	10010: "%%0商品不在可售范围内",
	10011: "%%0区域不可售",
	10012: "%%0商品不在用户的商品池中",
	10013: "%%0商品已下架",
	10014: "%%0商品不可售",
	10015: "%%0商品异常，请稍后重试",
	10016: "%%0区域库存不足",
	10017: "%%0获取运费失败",
	//订单11xxx
	11000: "%%0订单不存在",
	11001: "%%0请勿重复下单",
	11002: "%%0不可退单",
	11003: "%%0退单失败,订单状态已更新",
	11004: "%%0下单失败",
	11005: "%%0余额不足",
	11006: "%%0金额达到预警级别",
	11007: "%%0预付款不足,请联系客服处理",
	11008: "%%0收货人地址有误",
	11009: "%%0附件库存不足",
	11010: "%%0商品不在用户的商品池中",
	11011: "%%0商品无货",
	11012: "%%0订单状态不属于可补单状态",
	11013: "%%0支付失败",
	11014: "%%0订单已关闭",
	11015: "%%0收货人姓名不能包含特殊字符",
	11016: "%%0此地点不支持配送",
	11017: "%%0提交采购单过快!",
	11018: "%%0商品价格已变更,请稍后再试!",
	11019: "%%0订单已退单!",
	11020: "%%0支付失败",
	11021: "%%0收货地址不存在",
	11022: "%%0购物车最多允许添加3000件商品",
	11023: "%%0购物车商品不存在",
	11024: "%%0收货地址不存在",
	11025: "%%0支付密码不正确",
	11026: "%%0未设置支付密码",
	11027: "%%0您没有权限使用该方式下单",
	//售后 12xxx
	12000: "%%0售后单不存在",
	12001: "%%0数量超过订单商品数量",
	12002: "%%0订单未妥投，暂不支持售后",
	12003: "%%0取消售后失败",
	12004: "%%0申请售后失败",
	12005: "%%0该售后单不可取消",
	12006: "%%0订单状态错误",
	12007: "%%0未发货,暂无物流信息",
	12010: "%%0不支持的售后类型",

	//60xxx系統
	60100: "%%0菜单规则名称已经存在",
	60101: "%%0路由地址已经存在",

	//账号 4xxxx
	//应用相关
	40000: "%%0",
	//账号相关
	41001: "账号信息错误",
	41002: "账号已存在",
	41003: "账号或密码错误",
	41004: "升级/续费年限错误",
	41005: "过期时间超过一年，暂不支持续费",
	41006: "升级版本必须高于当前版本",
	41007: "升级剩余天数异常",
	41008: "域名错误",
	41009: "该版本价格小于当前版本不支持升级",
	41010: "ticket错误",
	41011: "账号原密码错误",
	41012: "邀请码错误",
	41013: "账号被禁用",
}

func GetCodeMsg(code int, message string) (msg string) {
	msg = CodeService[code]
	if msg == "" {
		return
	}
	msg = strings.Replace(msg, "%%0", message, -1)
	return
}
